[
  {
    "name": "Btwin Ultra 920 review",
    "date": "September 8, 2018",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "Enhanced by feedback from the French Btwin-sponsored development squad, the Ultra 920 is unashamedly pitched at the racer in all of us.Perhaps not what you’d expect from the in-house brand of sports superstore Decathlon. Beyond the bike’s racing credentials, it also sports a stunning paint job – we’re suckers for a flash of pink.B’twin claims its Ultra Evo Dynamic carbon-fibre frame is ‘the most advanced frame for tackling mountain climbs and winning the most demanding classic races’, and that it was ‘specially designed for the most climbers and sprinters’.Their U19 team rides this frame at races such as Liège-Bastogne-Liège, so this rings true. The frameset features an oversized, square-profile down tube and chunky head tube.Conversely, its bladed carbon forks seem positively slender by comparison and taper towards their ends, where a standard quick-release skewer attaches the front wheel (this is the only bike of our four not to use a thru-axle).A great expanse of carbon-fiber wraps around a press-fit 86mm bottom bracket, while deep-section chainstays keep the rear end stiff for a better response to the power input.Narrow seatstays project from the top of the seat tube in order to soak up vibrations that would otherwise be transmitted by the road.All the cabling is internally routed. If you were the slightest bit concerned about buying a bike from a sports superstore, be aware that this frame also comes with a five-year guarantee.",
    "img": "https://i.ibb.co/kXTD51F/blogs-1.jpg"
  },
  {
    "name": "Van Nicholas Skeiron Disc review",
    "date": "September 8, 2019",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "To look at the gleaming metal tubes and the ornate logo, it would be easy to assume that Dutch brand Van Nicholas has a long and rich history of frame building.In fact, it’s about a decade old and only really came to prominence in 2012 when it was bought by Koga bikes.The fact that the titanium specialist has built such a reputation in that time says a lot about its bikes, and the Skeiron is its first frame built for hydraulic disc brakes.Skeiron was the Greek god of the north-west wind, a name that might better lend itself to an aerodynamic carbon frame, but it does indicate that the purpose of this bike is to race.We optimized the frame for rigidity at the key stress points by incorporating a press-fit bottom bracket, ovalized down tube and hydroformed, tapered chainstays, and a tapered head tube and top tube,’ says Ralph Moorman, general manager of Van Nicholas. ‘That’s all further helped by the 12mm thru-axles for the wheels.In terms of material, Van Nicholas has mainly sided for butted tubes with a 3Al/2.5V titanium mixture, commonly called grade 9.A stiffer grade 5 (6Al/4V) mixture is used for the parts of the frame where higher rigidity will improve the ride.The head tube, bottom bracket, and dropouts are made of grade 5 material,’ says Moorman. For the most part, the softer grade 9 is used not for the economy, but for the challenges of producing a titanium bike.The choice for 3Al/2.5V is down to good mechanical properties and good weldability,’ says Moorman. ‘That’s why we are able to offer a lifetime guarantee.’The bike is far techier than one might assume. For instance, it was designed with Finite Element Analysis techniques in its construction.",
    "img": "https://i.ibb.co/WHYpPtx/blogs-2.jpg"
  },
  {
    "name": "Litespeed Cherohala SE review",
    "date": " September 8, 2020",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "Litespeed has been making titanium race bikes for more than 30 years, and the family-run company can boast a client list that features some of cycling’s biggest names, including Greg LeMond and Lance Armstrong (although in the latter’s case you may not have known it at the time, as the bikes were rebadged to avoid upsetting sponsors).The American brand truly hit the mainstream in 2002 thanks to its sponsorship of pro team Lotto Adecco. Australian sprinter Robbie McEwen took no fewer than 17 victories on his Litespeed Vortex, a cold-worked 6Al/4V titanium masterpiece.He piloted it to multiple stages wins at both the Giro d’Italia and Tour de France, while teammates Peter Van Petegem and Mario Aerts won the cobbled Spring Classics Omloop Het Volk and Flèche Wallonne respectively earlier that same season, proving the bike’s versatility.We still make elite-level race bikes’, says Litespeed’s chief product developer, Brad DeVaney, from the manufacturer’s factory in Chattanooga, Tennessee.There are only two elite race models now, but we still do pretty well with them in terms of sales. But in our line, it’s definitely gravel bikes that are thriving.Litespeed previously had the T5G as its gravel offering, which then evolved into its next-generation model, simply named ‘Gravel’, but DeVaney felt the brand needed to offer something more refined.The Cherohala project was about blurring the lines between an elite-level race bike and a utility bike,’ he says.I wanted to create a single frame that would give you more options to ride however you wanted, whether that’s riding on dirt, touring, or hanging with a group ride.",
    "img": "https://i.ibb.co/Brkfckq/blogs-3.jpg"
  },
  {
    "name": "Kuota Kiral Ultegra Di2 Elite review",
    "date": "September 8, 2021",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "While it might not be to everyone’s liking, we really dig the Kiral’scamo color scheme, it beats seeing yet another solid black bike and gives it a styleall its own.Intriguingly, it also stands to highlight some of the key shapes and forms of the frame while masking others.When it comes to the equipment Kuota’s UK people offer a number of optional builds based on the same £1,725 frameset, from a budget-conscious Shimano 105 selection up to a blowout Dura-Ace Di2, and a range of Mavic wheels.It makes the bikes highly customizable without an endless list of options that simply confuse.Components include the highly respected Deda Zero2 bar and stem, with the perch selected as San Marco’s Concor saddle.With its pronounced triangulation running from the head tube back it’ll come as little surprise that this is a stiff front end and it’s never more evident than when levering yourself up steep inclines.Likewise the compact rear triangle and 31.6mm Seatpost make for a taut feel and with very little flex.Having not used the Mavic UST system before it was interesting to note that the tires were working hard and were the main source of comfort, meaning that the 10-15psi drop in tire pressure they afforded helped maintain comfort.These elements combine with the slightly detuned geometry to help the Kiral go after the more race-oriented end of the sportive market.",
    "img": "https://i.ibb.co/SJB0SWn/blogs-4.jpg"
  },
  {
    "name": "The new BMC Timemachine integrated bottles review",
    "date": "September 8, 2022",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "The roads around the lake of Zurich, Switzerland, are packed with luxury cars, so it is easy to understand why Mart Oten, Road Product Manager at BMC, chose the car comparison to present the new TimeMachine.A BMC RoadMachine could be seen as a Porsche 911, there are comfort and reliability… but our new TimeMachine is more like a supercar, something that is eye-catching, something you want to get noticed by,’ he said at the bike’s launch. And it does the trick.With its sleek tubes, its high wheels, with all the integrations it presents, you will not blend into the bunch riding this new BMC.The Swiss brand was already ahead of its time when the first TimeMachine came out in 2012. It was considered the first real aero bike with a lot of integrated parts.The idea was to gain speed on the bike without extra effort – a sort of ‘free speed’ – as Owen put it.Six years later the concept still remains with the new iteration. Just like in 2012 it still looks fast and sleek but an extra comfort was added to its DNA.On the speed part, the model was both tested in a wind tunnel and on tracks to validate the choice of tube shapes.Then there was the water bottle issue, the BMC team realizes that it should include the bottles in the aerodynamics measurements, hence the new part located on the downtube called Aeromodule, and the results showed the bike was faster with this system on than without.All the new TimeMachine bikes will be sold with the Aeromodule and below the bottle cages, BMC inserted a little box (the Safety Kit) containing inner tube and repairing kit (very similar to the Swat box that equipped the new Specialized Roubaix).",
    "img": "https://i.ibb.co/dDkDRPv/blogs-5.png"
  },
  {
    "name": "Specialized S-Works Tarmac Disc review",
    "date": "October 8, 2022",
    "city": "City Bike, Road Bicycle, Tour Bicycle",
    "description": "Disc brakes or no disc brakes? That is the question. For Specialized it’s a more important question than for most because it has committed totally to the move towards disc brakes, claiming that it might eventually phase out its rim brake bikes altogether.The Tarmac has always been a pure-bred race bike,’ says Specialized’s Chris Riekert. ‘But I think when we launched the original Tarmac Disc two years ago [see a review on page 2], the disc bike was seen as a club enthusiast’s bike because you couldn’t race it.Since then, however, the rules have changed – both literally and figuratively – and the bike now seems to be gaining traction with pro cyclists.Zdenek Stybar and Elia Viviani, both of Quick-Step Floors, have been competing on the Tarmac Disc this year, and Specialized has the stats to back up the pro endorsement.If the addition of discs costs nothing in terms of weight, stiffness or aerodynamics – while offering improved braking quality – does that make the Tarmac SL6 Disc the perfect offering?The rim brake version was certainly a bike that made an impression. At the recent Cyclist Track Day series (where visitors got to try out top-end bikes from a large number of the big brands) it was one of the most popular bikes thanks to its smooth ride, lightning acceleration and assured handling.",
    "img": "https://i.ibb.co/TYSgBPM/blogs-6.jpg"
  }
]